#if __name__ == '__main__':
name = 'Alexander'
print('Name:',name)
age = 38
print('Age:',age)
age = age + 1
print('New Age:',age)
is_student = True
print('Is Student:',is_student)

"""Создайте переменные разных типов данных:
  - Создайте переменную name и присвойте ей значение вашего имени (строка).
  - Выведите значение переменной name на экран.
  - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
  - Выведите значение переменной age на экран.
  - Перезапишите в age текущее значение переменной age + новое
  - Выведите измененное значение переменной age на экран.
  - Создайте переменную is_student и присвойте ей значение True (логическое значение).
  - Выведите значение переменной is_student на экран."""