my_string = input('Input some text with space: ')
print(len(my_string))                      # подсчет количества символов в строке
print(my_string.upper())                   # Вывод строки my_string в верхнем регистре.
print(my_string.lower())                   # Вывод строки my_string в нижнем регистре.
print(my_string.replace(" ", "")) # удаление всех пробелов.
print(my_string[0])                        # вывод первого символа строки my_string
print(my_string[-1])                       # вывод последнего символа строки my_string
print(my_string.capitalize())              # Увеличиваем первый символ строки и выводим на экран
print(f'Вы сказали "{my_string}" или мне послышалось?') # применение «f-строки» для интерполяции строки.
                                                        # Интерполяция строк в Python позволяет динамически
                                            # вставлять переменные в строки, делая код более читаемым и эффективным

"""Организуйте программу:

Создайте переменную my_string и присвойте ей значение строки с произвольным текстом (функция input()).
Вывести количество символов введённого текста

"""